[
	{
		"id_rp": "2645",
		"id_proj": "11",
		"name_rp": "Компоненты электронной техники",
		"name_proj": "Анализ динамики COVID-19 в России",
		"text_rp": "Рассмотрены основные свойства и характеристики пассивных элементов электронной техники. Дается описание линейных и нелинейных резисторов, конденсаторов различных типов и катушек индуктивности. Описываются их основные характеристики, свойства, особенности изготовления и эксплуатации Рассматриваются трансформаторы, выпрямители и фильтры на основе пассивных компонентов. Даны материалы по условиям их применения и режимам работы. . . Знание принципов действия, конструкции и технологии изготовления компонентов электронной техники. Формирование умения освоения основных эксплуатационных характеристик электронных компонентов, умение их выбора для разных видов электронной аппаратуры. Формирование навыков экспериментальных исследований свойств компонентов электронной техники.. Введение. Современное состояние электронной техники. Соотношение между дискретными и интегральными компонентами. Факторы, ограничивающие плотность упаковки элементов в РЭА. Тема 1. Основные характеристики резисторов. Сопротивление и температурный коэффициент сопротивления резисторов. Классы точности. Методы подгонки величины сопротивления. Номинальная мощность рассеяния и график нагрузки резистора. Электрическая прочность резисторов. Нелинейные свойства и шумы резисторов. Специфические параметры переменных резисторов. Виды функциональных характеристик регулирования сопротивления, методы их реализации. Основные характеристики нелинейных полупроводниковых резисторов. Тема 2. Основные типы резисторов. Классификация резисторов. Сравнительные характеристики постоянных резисторов различных типов, их конструкция. Резисторы общего и специального назначения. Основные типы и конструкции переменных резисторов. Нелинейные полупроводниковые резисторы: термисторы, позисторы, варисторы, фоторезисторы, магниторезисторы. Тема 3. Основные характеристики электрических конденсаторов. Емкость конденсаторов различных конструкций. Температурный коэффициент емкости. Группы по ТКЕ. Сопротивление изоляции и постоянная времени. Явление абсорбции электрических зарядов в конденсаторах. Потери энергии в конденсаторах. Расчет тангенса угла потерь конденсатора с учетом потерь в рабочем и вспомогательном диэлектриках и в металлических частях конденсатора. Индуктивность и полное сопротивление конденсатора. Методы уменьшения индуктивности конденсаторов. Кратковременная и длительная электрическая прочность конденсаторов. Причины старения конденсаторов. Явление поверхностного пробоя. Понятие о надежности и сроке службы конденсаторов. Удельные характеристики конденсаторов, их связь с рабочим напряжением, частотой и стоимостью конденсатора. Тема 4. Основные типы конденсаторов. Классификация конденсаторов. Конструктивно-технологические особенности конденсаторов на основе неорганических диэлектриков. Преимущества керамических конденсаторов. Связь структуры керамики с электрическими характеристиками конденсаторов. Конденсаторы на основе полупроводниковой керамики. Высоковольтные керамические конденсаторы. Конденсаторы на основе синтетических пленок, их преимущества и недостатки. Комбинированные пленочные конденсаторы. Основные разновидности оксидных конденсаторов, их конструктивно-технологические и эксплуатационные особенности. Сравнение оксидных конденсаторов на различных вентильных металлах. Ионисторы, их свойства и применение. Навесные конденсаторы для ГИС. Конденсаторы переменной емкости. Переменные и подстроечные конденсаторы с газообразным и с твердым диэлектриком. Тема 5. Индуктивные элементы. Основные конструкции и методика расчета катушек индуктивности. Индуктивность, собственная емкость и полное сопротивление катушек индуктивности. Добротность катушек индуктивности, методы ее увеличения. Магнитные сердечники катушек индуктивности. Тема 6. Соединительные и коммутационные элементы. Физические процессы в прижимном электрическом контакте. Электрические и механические параметры электрических контактов. Типы соединительных и коммутационных элементов. Тема 7. Компоненты преобразовательных устройств. Структура блока питания РЭА. Роль трансформатора, его принцип действия. Выбор его конструкции в зависимости от нагрузки. Однополупериодная схема выпрямления: принцип действия, достоинства и недостатки. Расчет параметров и выбор вентеля. Двухполупериодный выпрямитель на трансформаторе со средней точкой. Двухполупериодная мостовая схема выпрямления. Роль фильтров. Емкостные и индуктивные фильтры. LC многозвенные фильтры. Заключение. Влияние элементной базы на конструкцию, технологию изготовления и потребительские свойства современной электронной аппаратуры.",
		"text_proj" : "Web-приложение для отображения динамики различных характеристик распространения COVID-19 в России. ·       Приложение должно отображать различные характеристики, как исходные, так и производные, вычисленные приложением. Так же иногда полезно иметь возможность наложить несколько характеристик друг на друга. ·       Примеры исходных характеристик: динамика новых случаев, динамика выздоровлений. Примеры производных характеристик: разница между новыми случаями и выздоровлениями (больше людей заболевает или больше выздоравливает - растёт или уменьшается нагрузка на систему здравоохранения). Команда Frontend разработчик Backend разработчик iOS/Android разработчик. Как таковых обязательных требований нет. Смотрите желательные. . Технологический стек Frontend Javascript / typescript; фреймворки на выбор: React + Redux, Vue, Angular. Backend Java / Kotlin; Spring framework. C#; WebAPI, EntityFramework или Dapper. Mobile (опционально) iOS/Android приложение для отображения различных графиков. В результате получит: знания: разовьете свои знания по указанным технологиям опыт: работа в команде по методологии SCRUM, распределенной разработке, общее понимание коммерческой разработки Потенциальное трудоустройство .",
		"need_match":  false
	},
	{
		"id_rp": "2649",
		"id_proj": "16",
		"name_rp": "Философия",
		"name_proj": "Разработка системы вскрытия объектов на кадрах видеопотока",
		"text_rp": "Философия – гуманитарная дисциплина, изучающая общие и фундаментальные проблемы, такие как проблемы, связанные с реальностью, экзистенцией, знанием, ценностями, сознанием, мышлением и языком. Философия отличается от других способов решения таких проблем своим критическим и системным подходом и опорой на рациональные аргументы. Изучение философии формирует целостное представление о мире, его структурной организации и свойствах, определяет мировоззрение человека и общества, составляет методологическую основу их деятельности. Среди центральных проблем формирующейся в настоящее время новой философской парадигмы можно назвать: разработка теоретической модели сложного и противоречивого современного мира, обоснование роли человека и субъективного фактора в его развитии, становление информационного общества как мирового процесса, коэволюция его с окружающей средой и др.. Изучение основных направлений в философии, приобретение знаний по основным разделам курса философии, в том числе особенностей функционирования знания в современном обществе, соотношения истины и заблуждения, рационального и иррационального в человеческой деятельности, значение духовных ценностей и их места в мировой культуре. Формирование теоретического мировоззрения, широкого культурного кругозора студентов в процессе изучения законов возникновения, функционирования и развития природы, общества и мышления, умения работать с общенаучным и специальным категориальным аппаратом для понимания междисциплинарного подхода к проблемам и явлениям природной и социальной реальности. По итогам освоения дисциплины обучающийся должен демонстрировать знание основных философских понятий и категорий, закономерностей развития природы, общества и мышления, особенностей этапов становления философской мысли. По итогам освоения дисциплины обучающийся должен демонстрировать умение использовать основы философских знаний для формирования мировоззренческой позиции. Освоение методов критического восприятия, анализа и оценки исторической, философской и экономической информации, навыков методологического анализа и оценки научных и специальных проблем, навыка аргументировано систематизировать и обобщать информацию, правильно употреблять философскую терминологию в различных контекстах. . Здание №1 ТЕСТ. 1. Соотнесите понятия и философские школы: 1) атараксия  А. эпикуреизм 2) апатия  Б. кинизм 3) автаркия В. стоицизм 2. Учение, согласно которому Бог - безличное начало, слитое со всем мирозданием, называется А. политеизмом  Б. неотомизмом В. пантеизмом  Г. теологизмом Д. деизмом   3. Высказывание «Все течет и ничто не становится» принадлежит А. Гесиоду Б. Гераклиту В. Гомеру Г. Гераклу Д. Герострату 4. Кто из представителей патристики считал, что знание превыше веры? А. Климент Б. Тертуллиан В. Ориген  Г. Августин Д. все Е. никто 5. Какой или какие из приведенных примеров относится к идолу рынка (или площади)? А. Глаз человека способен различать 3 основных цвета (синий, зеленый и красный, все остальные цвета – переходные между тремя основными), в то время как рак-богомол различает 12 основных цветов; Б. Мы используем слово «нелицеприятный» в значении «неприятный» вместо «беспристрастный»; В. Человек часто искажает правду ради вознаграждения; Г. Человек изменяет свою точку в соответствии с мнением большинства. 6. Индукция - это А. философское направление   Б. учение Фрэнсиса Бэкона В. вид умозаключения  Г. разновидность силлогизма Д. логический закон 7. Положение Декарта «Я мыслю, следовательно, я существую» надо понимать в том смысле, что А. существует абсолютно все, что можно помыслить Б. мое мышление порождает мое существование В. я знаю о собственном существовании благодаря мышлению Г. если бы я не мыслил, я бы не существовал Д. если я существую, значит я мыслю 8. Приведите примеры мифологического, религиозного, философского и научного объяснения одного и того же явления природы или события. 9. Высказывание «Лишь согласно общепризнанному мнению существует цвет, сладкое, горькое, в действительности же существуют только атомы и пустота» относится к: А. объективному идеализму Б. субъективному идеализму, В. материализму. 10. Высказывание «Мир - комплекс представлений, возникающих в сознании» относится к: А. объективному идеализму Б. субъективному идеализму, В. материализму.  . . Введение. Понятие и структура мировоззрения. Особенности мифа и религии как исторических типов мировоззрения. Предмет философии. Особенности, выражающие специфику философского знания, его отличие от научного, религиозного и обыденного взгляда на мир. Мировоззренческая, методологическая и др. функции философии. Философская рефлексия как метод философского познания. Тема 1. Этапы развития философии и основные типы философской мысли. Тенденции возникновение и развития западноевропейской философии. Основные этапы развития философии. Особенности философии в Древнем мире: космоцентризм, проблема «первоначал», меры. Теоцентризм средних веков. Представление о патристике и схоластике, полемика номиналистов и реалистов. Особенности свободомыслия в средние века. Антропоцентризм, пантеизм и гуманизм в философии Возрождения. Становление нового метода и новых представлений о мире. Эмпиризм, рационализм, сенсуализм в философии Нового времени. Материализм и деизм мыслителей Нового времени и эпохи Просвещения. Классическая и неклассическая философия. Русская философия, этапы становления. Особенности русской философии. Развитие русской философской мысли периода XIX- начала XX веков, специфические черты национального философствования. Основные направления и школы философии XX и XXI вв. Тема 2. Философская онтология. Проблемы реальности в классической и современной философии. Онтология как учение о бытии. Понятие реальности, ее сущностные признаки. Материя как объективная реальность. Движение, самодвижение и основные формы их существования. Пространственно-временная структура реальности. Виртуальная реальность. Социальная реальность и ее специфика. Тема 3. Идея развития в философии. Понятия движения и развития, их соотношение. Диалектика как учение о развитии и связи. Понятие о категориях, основных законах и принципах диалектики. Основные законы диалектики. Проблема направленности изменений. Прогресс, регресс, реорганизация. Детерминизм и индетерминизм. Причина и следствие, их диалектика. Необходимость и случайность: их место и роль в процессе развития. Тема 4. Философские проблемы сознания и языка. Сознание как субъективная реальность. Идеальность сознания. Структура сознания. Самосознание и личность. Сознательное и бессознательное. Сознание и язык. Развитие представлений о сознании в истории философской и научной мысли. Современные научные представления о сознании и его эволюции. Сознание как особая форма отражения действительности. Отражение и информация. Тема 5. Познание мира. Формы и методы научного познания. Проблема познаваемости мира в основных направлениях философии. Субъект и объект познания. Формы чувственного и рационального познания, их взаимодействие. Рациональное и иррациональное в познавательной деятельности. Специфика эмпирического познания. Сущность научных теорий и их роль в научном познании. Проблема истины и её критериев. Виды истины. Классическое и неклассическое понимание истины. Проблема критерия истины. Практика как критерий истины. Истина и заблуждение. Релятивизм и догматизм. Тема 6. Общество как предмет философского анализа. Социальная философия и философия истории. Понятие общества и его структура. Формирование и развитие представлений об обществе и его структуре. Подсистемы общества: экономическая, духовная, социальная, политическая. Гражданское общество: формирование, содержание и значение идеи. Гражданское общество и государство. Основные концепции происхождения и сущности государства. Человек в системе социальных связей. Виды социальных общностей. Основные концепции дифференциации общества. Общество потребления. Информационное общество. Основные концепции исторического прогресса. Понятие общественно-экономической формации. Формационная и цивилизационная концепции общественного развития. Тема 7. Проблема человека в философии. Человек и природа. Природное (биологическое) и социальное в человеке. Антропологический поворот в современной философии. Проблема человека в современной философии. Человек и исторический процесс: личность и массы, свобода и необходимость. Роль личности в истории. Понятие свободы. Проблема человека в информационном обществе. Культура как мера человеческого в человеке. Заключение. Человек перед лицом глобальных проблем. Процессы глобализации, их сущность и потенциальные последствия. Концепция «устойчивого развития». Терроризм как глобальная проблема современности. ",
		"text_proj" : "Разработка системы вскрытия объектов на кадрах видеопотока. Объект исследования: информация с камеры на борту дрона Предмет исследования: выделение особых областей на кадре Цель: Провести разведку местности: сделать снимки поверхности (геопривязанные), вскрыть объекты, не являющиеся ландшафтом Проблема: Робастное определение, какой объект является частью ландшафта, а какой нет, требует формализации и подбора большого количества эвристик. Формулировка задачи: необходимо разработать алгоритм управления дроном, согласно которому дрон будет в процессе движения по некоторому полётному заданию, и делая геопривязанные снимки местности, находить объекты, не относящиеся к местности, отправляя информацию о них (положение и границы на каждом кадре, на котором объект найден) на внешний сервер. Обязательно должен: знать: язык программирования (С++ или Java или Python); уметь: работать в команде. Желательно должен: знать: математические сновы детекции объектов (понятие свёртки, машинного обучения.) владеть: английским языком достаточным для чтения статей. В результате получит: знания: математические основы компьютерного зрения, алгоритмы машинного обучения; умения: проведение научного исследования, прикладное создание программного фреймворка; опыт: работы на предприятии в условиях проекта, близкого к реальному. Сформировать список алгоритмов вскрытия. 1.Сформировать список алгоритмов вскрытия. Создать framework, позволяющий решать задачу вскрытия несколькими методами. 1.Создать framework, позволяющий решать задачу вскрытия несколькими методами. Сформировать критерии сравнения алгоритмов. 1.Сформировать критерии сравнения алгоритмов. Сравнить запрограммированные алгоритмы по выбранным критериям. 1.Сравнить запрограммированные алгоритмы по выбранным критериям.",
		"need_match" :  false
	},
	{
		"id_rp": "2646",
		"id_proj": "44",
		"name_rp": "Диэлектрические материалы и приборы",
		"name_proj": "Разработка системы проверки доставки писем на электронную почту",
        "text_rp": "Рассматриваются современные представления о поляризации, электропроводности, диэлектрических потерях, пробое и фазовых переходах в диэлектриках. Обсуждаются характеристики неорганических, полимерных и композиционных диэлектриков, как в объемном, так и в пленочном исполнении, технологические аспекты их получения и возможности применения. Основное внимание уделяется свойствам активных диэлектриков: сегнетоэлектриков, пироэлектриков, пьезоэлектриков, электретов, а также нанокомпозитов, содержащих активные диэлектрики. Подробно рассмотрены современные перспективные направления использования диэлектрических материалов при создании электронной компонентной базы. . Основной целью дисциплины является формирование у студентов системного подхода в изучении физических процессов, явлений в диэлектриках, в том числе и активных диэлектриках, в массивном и пленочном исполнении для изделий микросистемной техники. Задачи дисциплины включают: - получение знаний о реальных значениях диэлектрических параметров, технологических аспектах получения и возможных применениях диэлектриков; - освоение методик расчета электрических полей, электрофизических параметров диэлектрических материалов и диэлектрических преобразователей. - приобретении навыков в практическом применении методов теоретического расчета и анализа параметров диэлектриков: объемных диэлектриков, тонких диэлектрических пленок и наноструктур, а также преобразователей на основе активных диэлектриков. Знание и понимание сути физических процессов и явлений в диэлектриках, в том числе в активных диэлектриках, технологических аспектов получения и особенностей применения диэлектриков в изделиях микро – и нанотехники, принципов работы и характеристик изделий микро – и нанотехники. Умение: - выполнять анализ исследований и разработок, связанных с созданием и свойствами диэлектрических материалов, а также применением их в приборах микро-и нанотехники; - формулировать цели и задачи научных исследований и разработок в соответствии с тенденциями и перспективами развития современной электронной компонентной базы. Владение навыками применения полученных знаний о диэлектрических материалах и приборах при разработке изделий микро-и нанотехники. . Индивидуальное домашнее задание (ИДЗ) выполняется одновременно с чтением лекций, тематика индивидуального домашнего задания связана с лекционным материалом. Студентам необходимо решить специальные задачи или продумать теоретические ответы на предложенные вопросы, выполнив при этом  обстоятельный обзор современной литературы по выделенной проблеме.  ИДЗ оформляется в виде эссе (реферата), в котором приводится  описание основных методик или  применяемых технологических процессов получения и исследования диэлектрических материалов или диэлектрических приборов, достигнутые научные результаты,  их обсуждение, список используемой литературы. По теме ИДЗ должна быть подготовлена презентация, апробация которой запланирована на практических занятиях. Такие требования призваны повысить интерес студентов к научно-практической  деятельности и  предоставляют возможность проявления индивидуальных способностей. Выполнение индивидуальных домашних заданий в форме реферата на заданную тему и соответствующего доклада с презентацией осуществляется  бригадой студентов в количестве 2-3 человек. Список тем рефератов предлагается студентам на выбор на 1-4 неделях учебного семестра. Срок сдачи готовых рефератов: 10-13 недели учебного семестра. Выступления на практических занятиях с презентациями по теме рефератов на 14-17 неделях учебного семестра. Ориентировочная трудоемкость индивидуального домашнего задания 36 ак. часов.   Предлагаемые темы  1.     Диоксид кремния. Применение в электронике. (The silicon dioxide. Application in electronics.) 2.     (Синтетические опалы на основе диоксида кремния. Получение. Свойства. Применение.( Synthetic opals based on silica. Manufacturing. Properties. Application.) 3.     Пьезоэффект. Пьезоэлектрические материалы. Области применения. (A piezoelectric effect. Piezoelectric materials. Application.) 4.     Пьезоэффект. Пьезопреобразователи. Принцип действия. Конструкции. Применение. (A piezoelectric effect. Piezoelectric transducer. The principle of operation. Design. Application.) 5.     Пьезокерамические актюаторы. Характеристики. Области применения. Принцип действия. Конструкции. (Piezoceramic actuators. Characteristics. Application. The principle of operation. Design.) 6.     Пироэффект. Пироэлектрические материалы. Преобразователи на пироэлектриках. (The pyroelectric effect. Pyroelectric materials. Pyroelectric converters.) 7.     Электретные преобразователи: микрофоны, телефоны, дозиметры, фильтры и др.  (Electret transducers: microphones, telephones, dosimeters, filters, etc) 8.     Электретный эффект. Электретные материалы. Способы получения электретов. (Electret effect. Electret materials. Methods for producing electrets.) 9.     Электретный эффект. Поля электретов. Методы определения электретного потенциала. (Electret effect. The fields of electrets. Methods of determining the electret potential) 10.  Анодные оксиды металлов. Получение, характеристики, применение. (Anodic metal oxides. Manufacturing, characteristics, application.) 11.  Конденсаторы с двойным электрическим слоем.  Принцип работы, характеристики, применение. (Capacitors with a double electric layer. The principle of operation, characteristics, application.). Введение. Описание содержания, целей и задач курса. Классификация диэлектрических материалов. Тема 1. Физические процессы и явления в диэлектрических материалах. Основные характеристики диэлектриков. Поляризация диэлектриков. Диэлектрическая проницаемость и восприимчивость. Анизотропия физических свойств. Тензоры диэлектрической проницаемости и восприимчивости. Виды поляризации в диэлектриках. Зависимость диэлектрической проницаемости от температуры и давления. Расчет диэлектрической проницаемости композиционных диэлектрических материалов. Анодные окислы вентильных металлов, получение и характеристики. Электролитические конденсаторы. Пористый анодный оксид алюминия. Суперконденсаторы. Электропроводность диэлектриков. Механизмы генерации носителей заряда и механизмы переноса заряда в диэлектриках. Токи абсорбции. Электропроводность диэлектриков в зависимости от типа носителей заряда. Энергия активации электропроводности. Зависимость проводимости от напряженности поля, температуры, частоты. Электропроводность газов, жидких диэлектриков, твердых диэлектриков, пористых диэлектриков Обратимое и необратимое нарушение устойчивости непроводящего состояния в диэлектриках. Тема 2. Low-k и high-k диэлектрические материалы в интегральных микросхемах. Функции пассивных диэлектриков в микроэлектронике. Перспективы снижения топологических размеров ИС. Требования к low-k диэлектрикам для суб- 100-нм технологий. Материалы с ультранизкой диэлектрической проницаемостью. Эффект электромиграциии. Диэлектрические материалы с высоким значением k, преимущества их использования в микро-и наноэлектронике. Тема 3. Пьезоэлектрики и пьезоэлектрические преобразователи. Электрострикция и пьезоэлектрический эффект. Физические основы пьезоэффекта. Прямой и обратный пьезоэффекты. Основные параметры и характеристики пьезоэлектриков. Электрическое управление пьезоэффектом. Электромеханический вклад в диэлектрическую проницаемость. Пьезоэлектрические объемные и пленочные материалы на основе неорганических сегнетоэлектриков, полимеров, композиционных пьезоэлектриков, биополимеров. Пьезоэлектрические излучатели, микрофоны, резонаторы, двигатели, генераторы. Пьезоактюаторы, их характеристики, применение. Наногенераторы на основе оксида цинка. Пьезоэлектрические преобразователи на объемных и поверхностных акустических волнах. Тема 4. Пироэффект и пироэлектрические преобразователи. Пироэлектрический эффект. Теплоэлектрический и электрокалорический эффекты. Термо - пьезоэлектричество. Электрокалорический вклад в диэлектрическую проницаемость. Применение пироэлектриков: тепловидение, температурные сенсоры, теплоэлектрические преобразователи, электрокалорическое охлаждение. Пироэлектрические сенсорные элементы и материалы. Чувствительность пироэлектрического элемента. Тема 5. Физические эффекты в сегнетоэлектриках, сегнетоэлектрические преобразователи. Сегнетоэлектричество: нелинейные эффекты, петля гистерезиса, вольтфарадные характеристики, температурная и частотная зависимости электрофизических параметров сегнетоэлектриков. Сегнетоэлектрики и пироэлектрики. Диэлектрическая нелинейность. Вариконды. Эффекты переключения и энергонезависимая память на сегнетоэлектриках. Сегнетоэлектрические пленки. Особенности технологии получения и применения керамических сегнетоэлектрических пленок. Применение наноразмерных сегнетоэлектрических материалов. Тема 6. Электреты и электретные преобразователи. Физика электретного состояния. Основные параметры и характеристики электретов. Способы получения электретов и электретные материалы: полимерные электреты, керамические электреты, оксидные электретные материалы. Температурная и временная стабильность электретного потенциала. Механизмы объемной релаксации электретного потенциала. Роль перколяционных процессов в процессах поверхностной разрядки электретов. Методы повышения стабильности электретного состояния. Электретные микрофоны, телефоны, дозиметры, фильтры, сенсорные переключатели, клавиатура, крепежные устройства. Тема 7. Композиционные материалы. Органо-неорганические пленочные композиты, преимущества и проблемы. Композиты: полимер/сегнетоэлектрик, полимер/металл, полимер/ УНТ. Особенности технологии получения и электрофизические характеристики. Пленочные конденсаторные материалы повышенной электрической прочности с повышенными значениями диэлектрической проницаемости. Получение и исследование физических свойств нанокомпозиционных материалов на основе регулярных пористых диэлектрических матриц, инфильтрованных активными диэлектриками: сегнетоэлектриками, нелинейно-оптическими материалами, лазерно-активными средами. Тема 8. Полимерные диэлектрики. Полимеры, особенности строения. Термопластичные и термореактивные полимеры. Температура стеклования. Полимерные пленки: получение, характеристики, применение. Политетрафторэтилен, полиимиды. Полимерные покрытия, зависимость структурообразования от химического состава полимера, разветвленности цепей, наличия и характеристик наполнителя, степени адгезионного взаимодействия с подложкой. Использование диэлектрического метода для исследования молекулярной подвижности фрагментов молекулярной цепи. Полианилин, его свойства. Процесс создания и характеристики полимерного транзистора на основе полианилина. Заключение. Перспективные материалы функциональной диэлектрической электроники. Обобщение результатов изучения дисциплины и их практического приложения.",
		"text_proj" : "Разработка системы проверки доставки писем на электронную почту. В различных системах и сервисах университета используется отправка писем на электронную почту как средство доставки уведомлений. Часто такие письма не доходят до получателя: переполнен ящик, заведомо неверно написанный адрес — причин может быть множество. В случаях, когда письмо не доходит до адресата не по нашей вине, почтовый сервер сообщает о невозможности доставки с указанием причины. Письмо с таким ответом приходит отправителю. Необходимо разработать систему, которая будет получать такие письма, анализировать их и агрегировать информацию о проблемных почтовых адресах. В системе должен быть предусмотрен API для других систем и сервисов, которые могли бы получить информацию о \"мёртвых\" адресах и, например, удалить такой адрес из списка рассылки. Обязательно должен: знать: PHP, основы алгоритмов уметь: проектировать RESTful API; писать интеграционные и юнит-тесты; владеть: навыками работы в команде; технологиями совместной работы: git, task-tracker. Желательно должен: знать: IMAP, POP3, SMTP, etc. ",
		"need_match":  false
	},
	{
		"id_rp": "2648",
		"id_proj": "46",
		"name_rp": "Конфликтология",
		"name_proj": "Разработка интеллектуальных модулей обработки данных на FPGA",
		"text_rp": "Дисциплина «Конфликтология» знакомит с основными классическими и современными теориями социального конфликта. Предлагает видение современного социального конфликта в глобальной перспективе и освещает основные концепции глобального конфликта. В традиции, восходящей к Л. Коузеру и Р. Дарендорфу, интерпретирует конфликт в его интегративных функциях: как фактор групповой динамики и социальных изменений. Знакомит с типологией и формами конфликта, дает анализ элементов и этапов конфликта. Освещает групповые и индивидуальные стратегии поведения в конфликте. Формирует навыки анализа конфликтных ситуаций, профилактики и разрешения конфликтов.. Изучение основных теоретических знаний подходов к конфликту. Студенты должны знать классические и современные объясняющие модели социального конфликта. Формирование навыков анализа закономерностей возникновения и развития социального конфликта. Студенты должны уметь осуществлять диагностику конфликта. Знания основных классических и современных теорий социального конфликта. Умения анализа конфликтных ситуаций, профилактики и разрешения конфликтов. Освоение технологий управления конфликтом, форм его урегулирования. Студенты должны приобрести навыки управления конфликтами.. Порядок выполнения ИДЗ, подготовка отчета и защита ИДЗ. В процессе обучения по дисциплине Конфликтология студент обязан выполнить два ИДЗ. Под выполнением ИДЗ подразумевается написание реферативной части по теоретическим источникам, проведение эмпирического исследования по выбранной теме, подготовка отчета и его защита на практических занятиях. ИДЗ подготавливаются в рамках самостоятельной работы. Темы ИДЗ определены соответствующей темой рабочей программы. Оформление отчета студентом осуществляется индивидуально в соответствии с принятыми в СПбГЭТУ правилами оформления студенческих работ. Отчет оформляется после выполнения эмпирического исследования и представляется преподавателю на проверку. После проверки отчет либо возвращается (при наличии замечаний) на доработку, либо подписывается к защите. ИДЗ защищаются студентами индивидуально в форме презентации. По окончании презентации студенту задаются вопросы (другими студентами и/или преподавателем). Ответы на вопросы учитываются в итоговой оценке за ИДЗ. Примерные темы ИДЗ:  1.     Конфликт: возможно ли рациональное осмысление? 2.     Конфликт в гуманитарных науках 3.     Предмет конфликтологии 4.     Мировоззренческие основы современной конфликтологии 5.     Методологические основы конфликтологии. Контрольные работы в форме тестовых заданий. Пример тестового задания: 1. Объект конфликтологии – это конфликты в целом люди войны Примеры вопросов для проведения зачета с оценкой:  1.     Основные этапы развития конфликтологической проблематики. 2.     Институциализация конфликтологии в России: основные вехи. 3.     Мировоззренческие и методологические предпосылки конфликтологии. 4.     Социально-психологические интерпретации конфликта. 5.     Позитивистская традиция интерпретации конфликта: Э.Дюркгейм и Т. Парсонс. . Введение. Конфликтология как учебная дисциплина. Цели и задачи курса. Основные понятия и определения. Тема 1. Социальный конфликт в современном обществе. Многообразие национально-этических, политических, идеологических, профессиональных, межпоколенных и иных конфликтов в современных условиях. Модели современного Российского общества через призму конфликтологии. Проблемность способов институциализации и легитимизации конфликтов. «Конфликтологическая парадигма» западной социологии и невозможность прямого заимствования. Актуализация мировоззренческих и методологических традиций. Изучение конфликта в научных и учебных дисциплинах в РФ. Исследовательские проекты академических институтов, Российского Государственного Независимого Фонда, Профессиональной социологической ассоциации. Опыт преподавания в вузах. Профессия конфликтолога. Тема 2. Методологические традиции в интерпретации конфликта. Актуальность классических социологических теорий для осмысления социального конфликта. Осмысление социального конфликта в классическом позитивизме (О. Конт, Г. Спенсер, Э. Дюркгейм), в марксизме (К. Маркс), в понимающей социологии (М. Вебер). Место социального конфликта в общественных изменениях и развитии. Либеральная и социалистическая идеологии: два взгляда на социальный конфликт современного общества. Анализ противоречий и конфликтов «индустриального общества» в рамках классической социологии. Фундаментальные теоретические подходы к анализу социального конфликта: неомарксистский, социобиологический, функционалистский, неофрейдистский. «Конфликтная парадигма» в современной западной социологии (Р.Дарендорф, Л.Козер, Дж.Рекс). Тема 3. Современный социальный конфликт. Глобальное измерение. Основные противоречия процесса глобализации современного мира. Кризис «глобального управления». Глобальное, региональное, локальное, личное. Классическое видение глобального конфликта. Либеральный проект и социальный конфликт. Социальная интеграция в традиционных и развитых современных обществах. Исторический опыт Запада в осознании и разрешении социального конфликта. Политическая и социальная революция. Институционализация социального конфликта: теория «естественного права», «общественного договора», «человеческих отношений», «рефлексивной политики», «общественного консенсуса». Цивилизационный подход. Своеобразие социальных конфликтов процесса модернизации: цивилизационный конфликт, ценностный кризис, партикуляризация конфликтов. Кризис самоидентификации и межпоколенный конфликт. Этносоциальные конфликты. Тема 4. Конфликт и социальная интеграция. Теории среднего и микроуровней. Конфликт как средство интеграции: анализ внутригруппового и межгруппового взаимодействия. Конфликты в формальных и неформальных группах. Трудовые конфликты. Конфликты в организациях. Межгрупповой конфликт. Институциональный плюрализм и социальный конфликт. Стабилизирующая роль конфликта. Реалистический и нереалистический конфликт. Замещающие механизмы и предохраняющие клапаны. Конфликт в интеграционных и мобилизационных технологиях. Управляемый конфликт: основные технологии. Тема 5. Аналитика конфликта. Типология конфликтов. Многообразие форм социального конфликта. Переменные конфликта: насильственность и интенсивность. Структурный анализ: элемента конфликта. Процессуальный анализ: этапы конфликта. Динамика разворачивания конфликта. Профилактика конфликта. Социальные роли и позиции в конфликте. Тема 6. Поведение в конфликте: групповые и индивидуальные стратегии. Модели конфликтного поведения. Основные стили поведения в конфликте. Завершение конфликта: основные проблемы. Разрешение конфликтов. Принципы, модели, технологии. Конфликтолог и медиатор Проблема личностного самоопределения в конфликтной ситуации. Анализ конфликтной ситуации: формы и алгоритмы. Прогнозирование и предупреждение конфликтов. Заключение. Подведение итогов курса.",
		"text_proj" : "Разработка интеллектуальных модулей обработки данных на FPGA. Цель проекта – разработка интеллектуальных технологий обработки данных для встроенных систем.  Для достижения цели исследования необходимо решить следующие задачи: 1. Разработка новых моделей и методов и снижения размерности данных, коррекции систем без переобучения.  2. Разработка интеллектуальных методов и алгоритмов обработки данных в режиме реального времени. 3. Аппаратная реализация встроенных систем. Партнёры: Huawei, Siemens. . Обязательно должен: знать: основы программирования. уметь: работать с \"железом\". владеть: одним из языков высокого уровня. Желательно должен: знать: основы проектирования на FPGA. уметь: моделировать на Matlab или Python; владеть: языками VHDL или Verilog. . В результате получит: знания: в области архитектуры встроенных систем; умения: проектирования для FPGA; опыт: проектирования и реализации аппаратно-ориентированных интеллектуальных модулей обработки данных.",
		"need_match": false  
	},
	{
		"id_rp": "2650",
		"id_proj": "21",
		"name_rp": "Теоретические основы высокочастотной электротехники",
		"name_proj": "Развитие кабинетов Юридических и Физических лиц",
		"text_rp": "Рассматривается распространение электромагнитной волны в полубесконечной среде с постоянными физическими параметрами, понятие о поверхностном эффекте и скорости распространения электромагнитной волны. Расчет сопротивлений тел при ярко выраженном поверхностном эффекте. Токопроводы различных конструкций и их расчет при любых частотах. Рассматривается распространение электромагнитной волны в проводящей пластине в продольном магнитном поле, сплошном и полом цилиндрах. Плоская электромагнитная волна в двухслойной среде. Приближенный расчет параметров коротких индукторов. Расчет сопротивлений индукторов с различными нагрузками по методу общего потока.. Изучение законов, формирование знаний о закономерностях при взаимодействии электромагнитных волн с проводящими телами различной формы и электрофизических свойств. Формирование навыков расчетов в области электротехники с применением аналитических методов. Освоение современных программных средств, предназначенных для расчета параметров электромагнитных полей. Умение использовать оптимальный инструментарий для достижения результата.. Введение. Краткая аннотация учебного курса с указанием целей и основных задач курса. Тема 1. Плоская электромагнитная волна в полубесконечной среде с постоянными физическими параметрами. Понятие о поверхностном эффекте. Скорость распространения электромагнитной волны. Электрические и магнитные сопротивления. Расчет сопротивлений тел при ярко выраженном поверхностном эффекте. Тема 2. Шинопроводы. Одиночная шина. Система двух шин. Распределение напряженностей электрического и магнитного полей. Предельные случаи. Выражения для удельной мощности и сопротивлений. Система трех шин. Тема 3. Проводящая пластина в продольном магнитном поле. Распределение напряженностей электрического и магнитного полей. Предельные случаи. Выражение для удельной мощности и сопротивлений. Электрический КПД. Выбор частоты при сквозном нагреве. Глубина активного слоя. Нагрев пакета пластин. Тема 4. Сплошной цилиндр в продольном магнитном поле. Распределение напряженностей электрического и магнитного полей. Предельные случаи. Выражения для удельной мощности и сопротивлений. Электрический КПД. Выбор частоты при сквозном нагреве. Глубина активного слоя. Тема 5. Полый цилиндр в продольном магнитном поле. Граничные условия при решении уравнений ЭМП. Выражения для активного и внутреннего реактивного сопротивлений. Электрический КПД. Выбор частоты. Электрический КПД. Тема 6. Ферромагнитная среда. Стадии нагрева стальных тел. Поверхностный эффект в ферромагнитной среде. Теория Л. Р. Неймана. Распределение напряженностей электрического и магнитного полей. Электрические и магнитные сопротивления. Определение магнитной проницаемости на поверхности ферромагнитной среды. Тема 7. Плоская электромагнитная волна в двухслойной среде. Основные допущения. Решение уравнений ЭМП. Распределение плотности тока в зависимости от глубины первой среды и магнитной проницаемости второй. Выбор частоты при закалке. Выражения для удельной мощности, активного и внутреннего реактивного сопротивлений. Определение магнитной проницаемости на поверхности второй среды. Тема 8. Приближенный расчет параметров коротких индукторов. Картина магнитного поля. Схема замещения короткого индуктора для нагрева наружных поверхностей. Расчет сопротивления обратного замыкания и индуктивности рассеяния. Вычисление коэффициентов приведения параметров. Заключение. Обобщение лекционного материала. Подведение итогов.",
		"text_proj" : "В рамках проекта развития кабинетов Юридических и Физических лиц предстоит выполнение следующих задач: Реализация маркетплейса. Развитие собственной CRM-обращений. Задачи проекта реализуются в рамках отдела собственных решений департамента разработки бизнес-приложений. Обязательно должен знать:  основные структуры данных и методы работы с ними, Java Core, Spring Boot, Spring Security, SQL. Желательно должен знать: Kotlin, принципы работы нереляционных баз данных.  . В результате получит опыт работы на производственном проекте в роли Java разработчика.",
		"need_match":  false 
	},
	{
		"id_rp": "4833",
		"id_proj": "2",
		"name_rp": "Социология",
		"name_proj": "Разработка платформы сервисов личного кабинета ЛЭТИ",
        "text_rp": "Курс нацелен на формирование у студентов знаний о предмете, структуре и функциях социологии, а также о тенденциях, закономерностях и особенностях развития современного российского социума. В ходе занятий обучающиеся осваивают навыки анализа социально значимых процессов и явлений; использования современных социологических методов в решении своих профессиональных задач; организации анкетных опросов, составления программы социологических исследований. В результате изучения дисциплины у студентов формируются представление о месте человека в системе социальных связей и понимание социальной значимости их будущей профессии.. Цель дисциплины: изучение предмета, получение знаний по структуре, функций социологии, содержания основных фундаментальных социологических теорий; тенденций, закономерностей и особенностей развития современного российского социума. Задачи дисциплины: - формирование знаний и навыков, необходимых для анализа социально значимых процессов и явлений; - формирование толерантного восприятия социальных и культурных различий; - формирование социального взаимодействия на основе принятых в обществе моральных и правовых норм; - понимания социальной значимости своей будущей профессии. Приобретение знаний и навыков, необходимых для анализа социально значимых процессов и явлений. Умение управлять своим временем, выстраивать и реализовывать траекторию саморазвития на основе принципов образования в течение всей жизни. Приобретение навыков использования современных социологических методов в изучении реальности; организации простых анкетных опросов, составления программ небольших социологических исследований.. Порядок выполнения ИДЗ, подготовка отчета и защита ИДЗ. В процессе обучения по дисциплине Социология студент обязан выполнить одно ИДЗ. Под выполнением ИДЗ подразумевается написание реферативной части по теоретическим источникам, проведение эмпирического исследования по выбранной теме, подготовка отчета и его защита на практических занятиях. ИДЗ подготавливается в рамках самостоятельной работы. Тема ИДЗ определена соответствующей темой рабочей программы. Оформление отчета студентом осуществляется индивидуально в соответствии с принятыми в СПбГЭТУ правилами оформления студенческих работ. Отчет оформляется после выполнения эмпирического исследования и представляется преподавателю на проверку. После проверки отчет либо возвращается (при наличии замечаний) на доработку, либо подписывается к защите. ИДЗ защищаются студентами индивидуально в форме презентации. По окончании презентации студенту задаются вопросы (другими студентами и/или преподавателем). Ответы на вопросы учитываются в итоговой оценке за ИДЗ. Примерные темы ИДЗ:  1. Социология как наука об обществе; 2. Этапы социализации личности; 3. Социальные основы инженерной деятельности.. Контрольные работы в форме тестовых заданий. Пример тестового задания: 1.    Основоположником теории позитивизма был: Герберт Спенсер Огюст Конт Эмиль Дюркгейм Макс Вебер. . Введение. Социология в системе социально-гуманитарного знания. Тема 1. Предмет, структура и функции социологии. Определение объекта и предмета социологии. Основные подходы к структуре социологического знания. Содержание фундаментальных социологических теорий. Специфика социологических концепций среднего уровня. Особенности прикладного социологического знания. Познавательная, эвристическая, мировоззренческая, прогностическая, коммуникативная, идеологическая и другие функции социологии. Тема 2. Прикладная социология. Предмет и функции прикладной социологии. Методология, методика и техника прикладных социологических исследований. Программа и процедуры прикладного исследования. Классификация прикладных социологических исследований. Виды социологических опросов. Специфика анкетирования, наблюдения, интервьюирования, социального эксперимента и других социологических методов прикладных исследований. Место и роль социального моделирования, социальной экспертизы, социального картографирования в социологическом исследовании. Тема 3. Общество как целостная система. Основные концепции общества в социологии. Основания и признаки общества как целостной системы. Подсистемы и компоненты содержания общества как системы. Классификация типов общественных систем. Особенности постиндустриального общества. Характер и природа общественной системы современной России. Специфика российского пути к национальной модели постиндустриального общества. Тема 4. Теория социальной стратификации общества. Научные истоки теории социальной стратификации. Основные стратификационные критерии. Сущность социальной стратификации общества. Классификация стратификационных структур: кастовые, сословные, элементарные, кумулятивные, конгломеративные и др. Социальные страты современного российского общества. Питирим Сорокин о сущности социальной мобильности. Вертикальная и горизонтальная мобильность. Маргинальность и маргиналы. Проблемы социальной мобильности в современном российском обществе. Тема 5. Социальные институты общества. Сущность и признаки социального института. Понятие «социальный институт». Классификация социальных институтов. Специфика, природа и функции семьи, церкви, культуры, государства, организации и других основополагающих институтов общества. Особенности становления и формирования современных социальных институтов в России. Тема 6. Социальный статус и социальная роль. Социальный статус и социальные роли личности. Сущность ролевого конфликта. Классификация типов личности. Проблемы взаимоотношений личности и общества. Основные типы личности и проблемы ее развития в современном российском обществе. Личность как объект и субъект экономических отношений. Личность как субъект организационного поведения. Проблемы и аспекты социализации современной личности. Тема 7. Социальная норма и отклоняющееся поведение. Социальные нормы и ценности как регуляторы социального поведения. Нормы-ожидания и нормы правила. Социальный контроль и его функции. Механизмы и структура социального контроля. Понятие санкций. Понятия социальной нормы и социального отклонения. Культурно одобряемые и культурно неодобряемые отклонения. Делинквентное и девиантное поведение. Социологические теории девиантного поведения. Концепция аномии Э. Дюркгейма. Теория аномии Р. Мертона. Теория стигматизации. Феномен «спирали девиантности» и девиантная карьера. Социологический анализ отдельных форм девиантного поведения. Тема 8. Малые группы. Понятие малой группы и ее признаки. Преимущества и ограничения включенности индивида в группу. Инструментальная и экспрессивная функция групп. Коммуникации в группе. Модели внутригрупповых коммуникационных сетей. Ролевая структура группы. Типология внутригрупповых ролей. Групповая динамика и фазы развития группы. Групповая сплоченность и факторы, влияющие на ее уровень. Внутригрупповые отношения и климат внутри группы. Особенности принятия решений в группе. Формы группового обсуждения: групповые дискуссии, «мозговой штурм», «номинальные группы», «гудящие группы» и др. Тема 9. Социология организаций. Понятие «организация». Особенности социологических концепций организации. Социология о двойственной естественно-рациональной природе организаций. Классификация организаций. Формальная и неформальная организационная структура, понятие «социальной» организации. Феномен организационной культуры. Классификации организационной культуры. Понятие организационного развития. Организационные стратегии, инновации и внешняя среда как факторы развития организации. Заключение. Оценка социальной значимости будущей профессии обучающихся.",
		"text_proj" : "Разработка платформы сервисов личного кабинета ЛЭТИ. Личный кабинет студентов, аспирантов и сотрудников университета — центральная система во всей цифровой среде университета. ЛК обеспечивает внутрикорпоративное общение наравне с электронной почтой, доставку объявлений студентам, сервисы заказа справок, подачи заявлений и многое другое. Учётная запись в личном кабинете — ключ для доступа к другим системам и сервисам (включая Moodle, OpenEDX, Индивидуальные траектории, Расписание и многое другое. В 2021 году личным кабинетом начали пользоваться учащиеся подготовительного отделения иностранцев, а в 2022 году к числу пользователей добавятся преподаватели, не являющиеся сотрудниками, и абитуриенты университета. Для дальнейшего развития системы, в том числе за счёт сервисов, реализуемых другими командами разработки университета, необходимо разработать платформу сервисов с возможностью: встраивания части представлений в интерфейс ЛК с имитацией нативности; бесшовной авторизации на основе OAuth 2; подключения к пользовательским и сервисным API с разным уровнем доступа. Участник проекта обязательно должен: знать: HTML, JS, CSS уметь: проектировать интерфейсы пользователя; проектировать RESTful API; писать интеграционные и юнит-тесты; документировать код; владеть: навыками анализа требований пользователя; навыками работы в команде; технологиями совместной работы: git, task-tracker. Желательно должен: знать: PHP, Node.js, Webpack, SCSS, Vue.js владеть: навыками деловой переписки. ",
		"need_match":  false 
	},
	{
		"id_rp": "4833",
		"id_proj": "25",
		"name_rp": "Социология",
		"name_proj": "Android-приложение предобработки данных 3d-реконструкции",
        "text_rp": "Курс нацелен на формирование у студентов знаний о предмете, структуре и функциях социологии, а также о тенденциях, закономерностях и особенностях развития современного российского социума. В ходе занятий обучающиеся осваивают навыки анализа социально значимых процессов и явлений; использования современных социологических методов в решении своих профессиональных задач; организации анкетных опросов, составления программы социологических исследований. В результате изучения дисциплины у студентов формируются представление о месте человека в системе социальных связей и понимание социальной значимости их будущей профессии.. Цель дисциплины: изучение предмета, получение знаний по структуре, функций социологии, содержания основных фундаментальных социологических теорий; тенденций, закономерностей и особенностей развития современного российского социума. Задачи дисциплины: - формирование знаний и навыков, необходимых для анализа социально значимых процессов и явлений; - формирование толерантного восприятия социальных и культурных различий; - формирование социального взаимодействия на основе принятых в обществе моральных и правовых норм; - понимания социальной значимости своей будущей профессии. Приобретение знаний и навыков, необходимых для анализа социально значимых процессов и явлений. Умение управлять своим временем, выстраивать и реализовывать траекторию саморазвития на основе принципов образования в течение всей жизни. Приобретение навыков использования современных социологических методов в изучении реальности; организации простых анкетных опросов, составления программ небольших социологических исследований.. Порядок выполнения ИДЗ, подготовка отчета и защита ИДЗ. В процессе обучения по дисциплине Социология студент обязан выполнить одно ИДЗ. Под выполнением ИДЗ подразумевается написание реферативной части по теоретическим источникам, проведение эмпирического исследования по выбранной теме, подготовка отчета и его защита на практических занятиях. ИДЗ подготавливается в рамках самостоятельной работы. Тема ИДЗ определена соответствующей темой рабочей программы. Оформление отчета студентом осуществляется индивидуально в соответствии с принятыми в СПбГЭТУ правилами оформления студенческих работ. Отчет оформляется после выполнения эмпирического исследования и представляется преподавателю на проверку. После проверки отчет либо возвращается (при наличии замечаний) на доработку, либо подписывается к защите. ИДЗ защищаются студентами индивидуально в форме презентации. По окончании презентации студенту задаются вопросы (другими студентами и/или преподавателем). Ответы на вопросы учитываются в итоговой оценке за ИДЗ. Примерные темы ИДЗ:  1. Социология как наука об обществе; 2. Этапы социализации личности; 3. Социальные основы инженерной деятельности.. Контрольные работы в форме тестовых заданий. Пример тестового задания: 1.    Основоположником теории позитивизма был: Герберт Спенсер Огюст Конт Эмиль Дюркгейм Макс Вебер. . Введение. Социология в системе социально-гуманитарного знания. Тема 1. Предмет, структура и функции социологии. Определение объекта и предмета социологии. Основные подходы к структуре социологического знания. Содержание фундаментальных социологических теорий. Специфика социологических концепций среднего уровня. Особенности прикладного социологического знания. Познавательная, эвристическая, мировоззренческая, прогностическая, коммуникативная, идеологическая и другие функции социологии. Тема 2. Прикладная социология. Предмет и функции прикладной социологии. Методология, методика и техника прикладных социологических исследований. Программа и процедуры прикладного исследования. Классификация прикладных социологических исследований. Виды социологических опросов. Специфика анкетирования, наблюдения, интервьюирования, социального эксперимента и других социологических методов прикладных исследований. Место и роль социального моделирования, социальной экспертизы, социального картографирования в социологическом исследовании. Тема 3. Общество как целостная система. Основные концепции общества в социологии. Основания и признаки общества как целостной системы. Подсистемы и компоненты содержания общества как системы. Классификация типов общественных систем. Особенности постиндустриального общества. Характер и природа общественной системы современной России. Специфика российского пути к национальной модели постиндустриального общества. Тема 4. Теория социальной стратификации общества. Научные истоки теории социальной стратификации. Основные стратификационные критерии. Сущность социальной стратификации общества. Классификация стратификационных структур: кастовые, сословные, элементарные, кумулятивные, конгломеративные и др. Социальные страты современного российского общества. Питирим Сорокин о сущности социальной мобильности. Вертикальная и горизонтальная мобильность. Маргинальность и маргиналы. Проблемы социальной мобильности в современном российском обществе. Тема 5. Социальные институты общества. Сущность и признаки социального института. Понятие «социальный институт». Классификация социальных институтов. Специфика, природа и функции семьи, церкви, культуры, государства, организации и других основополагающих институтов общества. Особенности становления и формирования современных социальных институтов в России. Тема 6. Социальный статус и социальная роль. Социальный статус и социальные роли личности. Сущность ролевого конфликта. Классификация типов личности. Проблемы взаимоотношений личности и общества. Основные типы личности и проблемы ее развития в современном российском обществе. Личность как объект и субъект экономических отношений. Личность как субъект организационного поведения. Проблемы и аспекты социализации современной личности. Тема 7. Социальная норма и отклоняющееся поведение. Социальные нормы и ценности как регуляторы социального поведения. Нормы-ожидания и нормы правила. Социальный контроль и его функции. Механизмы и структура социального контроля. Понятие санкций. Понятия социальной нормы и социального отклонения. Культурно одобряемые и культурно неодобряемые отклонения. Делинквентное и девиантное поведение. Социологические теории девиантного поведения. Концепция аномии Э. Дюркгейма. Теория аномии Р. Мертона. Теория стигматизации. Феномен «спирали девиантности» и девиантная карьера. Социологический анализ отдельных форм девиантного поведения. Тема 8. Малые группы. Понятие малой группы и ее признаки. Преимущества и ограничения включенности индивида в группу. Инструментальная и экспрессивная функция групп. Коммуникации в группе. Модели внутригрупповых коммуникационных сетей. Ролевая структура группы. Типология внутригрупповых ролей. Групповая динамика и фазы развития группы. Групповая сплоченность и факторы, влияющие на ее уровень. Внутригрупповые отношения и климат внутри группы. Особенности принятия решений в группе. Формы группового обсуждения: групповые дискуссии, «мозговой штурм», «номинальные группы», «гудящие группы» и др. Тема 9. Социология организаций. Понятие «организация». Особенности социологических концепций организации. Социология о двойственной естественно-рациональной природе организаций. Классификация организаций. Формальная и неформальная организационная структура, понятие «социальной» организации. Феномен организационной культуры. Классификации организационной культуры. Понятие организационного развития. Организационные стратегии, инновации и внешняя среда как факторы развития организации. Заключение. Оценка социальной значимости будущей профессии обучающихся.",
		"text_proj" : "Android-приложение предобработки данных 3d-реконструкции. Видео-презентация проекта https://www.youtube.com/watch?v=2dM3OOvD6Lk Одной из самых нетребовательных технологий 3d-реконструкции выступает фотограмметрия - набор методов, позволяющий составить трехмерную модель по неупорядоченному набору снимков камер обычных смартфонов. Однако, у этой технологии есть большой недостаток - для качества модели очень важно, чтобы соседние снимки были сделаны с минимальным углом ракурсов друг относительно друга, а также, чтобы в кадре было как можно больше особых точек (дескрипторов) Для решения этой проблемы, предлагается разработать мобильное приложение, позволяющее вести съемку и выполнять предварительный анализ снимков на предмет их взаимного сходства и количества особых точек. Помимо этого, приложение должно давать интерактивные рекомендации по траектории съемки. В задачи на этот семестр войдут следующие активности: разработка и программирование эвристик для отсеивания фото, не соответствующих минимальным требованиям корректной реконструкции; разработка модуля выработки рекомендаций по съемке; реализация простейших SLAM алгоритмов для позиционирования снимков. Кандидат должен иметь опыт разработки Android приложений на Kotlin, обладать базовым опытом решения задач машинного зрения. Плюсом будет любой опыт работы с облаками точек, работы с сенсорными данными и OpenCV. В результате получит: знания по работе с облаками точек и 3d реконструкции, умения Android-разработки, опыт участия в исследовательском проекте. Тестовая задача для участия в проекте. Создайте Android-приложение для проведения фотосъемки. Решение должно соответствовать максимальному числу требований из списка:   - ввод шаблона именования снимков в пользовательском интерфейсе, - отображение счетчика снимков в интерфейсе приложения, Проект должен запускаться по понятной инструкции в Android Studio версии Android Studio Arctic Fox 2020.3.1 Canary 10 или выше.   Исходный код и материалы загрузите в репозиторий на Github и укажите ссылку в качестве ответа.",
		"need_match":  false  
	},
	{
		"id_rp": "1552",
		"id_proj": "29",
		"name_rp": "Методы и инструменты управления рисками организации",
		"name_proj": "Разработка программного комплекса для оценки вариабельности пульса по видеоизображения человека",
		"text_rp": "В данной дисциплине изучаются основы, термины и определения информационно-системной методологии управления рисками, востребованные в практике организации при разработке и производства изделия, согласованные с требованиями нормативной документации, в том числе по системной инженерии, с теорией надежности, теорией управления рисками, системно-инженерными принципами, с автоматизированными системами управления качества типа Windchill Quality Solutions. Особое внимание также обращено на информационно-системные основы построения методов, моделей и алгоритмов по оценке и анализу процессов жизненного цикла и обеспечении требуемых надежности и допустимых рисков.. Целью дисциплины является развитие инженерной подготовки профессиональных компетенций магистрантов, направленных на эффективное решение основных задач по управлению рисками организации при создании сложных технических систем. Задачи дисциплины: овладеть основными методами оценки и управления рисками в деятельности организации. Знания на уровне представлений: выработка целостного восприятия рисков организации, как сложного управляемого информационного процесса при создания технических систем; Знания на уровне воспроизведения: освоение методов поиска технических решений, направленных на снижение риска и обеспечение высокого качества и требуемой надежности изделия; Знания на уровне понимания: приобретение практических навыков применения современных методов и инструментов управления рисками организации для принятия рациональных решений. Умения использовать современные методы и инструменты управления рисками с целью качества и надежности создаваемого образца технической системы; Формулировать задачи анализа, оценки и контроля качества, надежности образцов технических систем с помощью изучения конкретных примеров. Формирование навыков решения задач управления рисками на основе современных информационных технологий при обеспечении качества и надежности образцов технических систем.. . Выберите все верные ответы – их может быть больше одного! 1. Выберите верное определение термина \"риск\": 1. Вероятностная мера возникновения опасных явлений 2. Характеристика размера нанесенного социального, экономического, экологического и других видов ущерба и вреда. 3. Ожидаемая частота или вероятность возникновения опасностей определенного класса. 4. Верно все вышеперечисленное. Вопросы с множественным выбором позволяют учащимся выбрать только один вариант. Все варианты ответа предъявляются одновременно, наряду с текстом задачи: 2. Определите типичную ошибку, допущенную в следующем отрывке текста: «отказы по причинным схемам возникновения подразделяются на следующие группы …» а. отказы с мгновенной схемой возникновения б. отказы из-за конструктивных дефектов в. отказы из-за постепенного старения   Вопрос со свободным ответом: 3. Технический риск – это ______________________________________________(При ответе используйте взаимосвязь: объект риска - источник риска - нежелательное событие). . Введение. Современные концепции управления рисками организации. Современное развитие концепций управления рисками. Интеграция менеджмента рисков в различные модели систем управления. Менеджмент рисков и корпоративное управление организацией. Менеджмент рисков как основа концепции устойчивого развития организации. Основы анализа надежности технических систем в целях управления рисками. Основные определения теории надежности. Показатели надежности. Математические модели безопасности. Основы расчета технических систем по надежности их элементов. Алгоритм обеспечения надежности технических систем. Инженерные методы анализа рисков. Предварительный анализ опасностей. Методы проверочного листа (CHECK-LIST) и «что будет если.?» («WHAT-IF»). Дерево отказов ДО (fault tree analysis-FTA). Процедура построения, содержание анализа и структура дерева отказов. Дерево событий – ДС (event tree analysis - ETA). Дерево решений. Логический анализ. Контрольные карты процессов. Таблицы состояний и сочетаний рисков. Информационно-системная методология управления рисками. Методология проектного управления в жизненном цикле (ЖЦ) изделия. Метод управления проектами \"Ворота качества\" (Quality Gates). Метод развертывания функции качества (QFD). Процессы управления рисками и надежностью изделий в парадигме системной инженерии. Положения информационно-системной методологии управления рисками и надежностью в процессах ЖЦ изделий. Исходные представления информационно-системной методологии управления рисками и надежностью в процессах ЖЦ изделий. Информационно-системная методология управления рисками и надежностью в процессах ЖЦ изделий. Модели, методики, информационно-системные и эвентологические шкалы в управлении рисками и надежностью в процессах ЖЦ изделий. Программный пакет WINDCHILL QUALITY SOLUTIONS, как инструмент управлении рисками. Общие сведения и приемы работы в PTC Windchill Quality Solutions Модуль FMEA – Анализ видов, последствий и критичности отказов Модули Windchill FTA и Windchill Дерево событий – Анализ деревьев отказов и деревьев событий Модуль Windchill RBD – Анализ надежности сложной структуры. Модуль Windchill LCC – Анализ стоимости жизненного цикла. Оценка надежности человека, как звена организации. Причины совершения ошибок. Методология прогнозирования ошибок. Основные принципы формирования баз данных об ошибках человека. Правовые аспекты анализа риска и управления безопасностью организации. Классификация промышленных объектов по степени опасности. Оценка опасности промышленного объекта. Система лицензирования. Экспертиза промышленной безопасности. Ответственность организации за нарушения законодательства и нанесенный ущерб. Учет и расследование. Государственный контроль и надзор за промышленной безопасностью. Разработка планов по предотвращению происшествий и локализации их последствий. Российское законодательство в области промышленной безопасности. Заключение. Принципы оценки экономического ущерба от происшествий. Понятие ущерба и вреда. Структура вреда. Экономический и экологический вред. Структура полного ущерба как последствий происшествий на технических объектах. Принципы оценки экономического ущерба. Заключение. Перспективы развития методов и инструментов управления рисками.",
		"text_proj" : "Разработка программного комплекса для оценки вариабельности пульса по видеоизображения человека. Целью проекта является разработка программного сервиса, который по входному видео вычисляет частоту пульса человека. Проект подразумевает, как разработку ПО, так и исследования различных методов для достижения поставленной цели. Базовые технологии проекта: python, opencv, numpy, docker Задачами проекта являются: – Анализ существующих алгоритмов обработки видео для получения амплитудных и частотных характеристик человека на видео – Реализация наиболее подходящего алгоритма обработки – Разработка метода вычисления пульса по обработанному видео – Проведение исследования на предмет корреляции полученных результатов и реального пульса (полученного с помощью мед. оборудования или различных умных устройств) – Формулировка технических требований к аппаратной составляющей системе для обеспечения ее работы в наиболее сложных условиях. – Английский язык для чтения технической литературы и научных статей – Знание языка программирования python – Опыт разработки в ОС Linux. Иметь опыт в: – Работа с opencv – Базовая работа с виртуализацией с помощью Docker. В результате получит: – Знания в области обработки видео – Опыт участия в R&D проекте – Опыт работы в команде – Опыт разработки интеллектуальных систем компьютерного зрения. Входная задача на OpenCV. Разработать программу на языке python, которая с помощью библиотеки opencv читает входное видео и преобразует его следующим образом: – уменьшает разрешение видео в 2 раза – переводит видео в черно-белый формат – выводит порядковый номер кадра в углу видео Затем сохраняет новое преобразованное видео формате.mp4 Результатом выполнения задания является открытый git репозиторий с инструкцией по запуску программы исходным кодом.",
		"need_match":  false 
	},
	{
		"id_rp": "1557",
		"id_proj": "30",
		"name_rp": "Бережливые технологии в менеджменте качества",
		"name_proj": "Разработка системы детектирования и идентификации объектов на кадрах",
		"text_rp": "Целью освоения дисциплины «Бережливые технологии в менеджменте качества» является формирование у студентов знаний об инструментах бережливого производства, навыков их применения и оценки их эффективности. Полученные знания и навыки позволят им применять бережливые технологии при управлении процессами, что позволит повысить их эффективность и снизить риски возникновения ошибок.. Целью изучения дисциплины является приобретение знаний об инструментах бережливого производства и формирование умений и навыков их применения, оценки их эффективности в соответствии со спецификой процессов организации. Задачами изучения дисциплины является: - изучение основных особенностей, понятий и принципов бережливого производства; - изучение современных технологий бережливого производства и методов их внедрения; - изучение взаимосвязей бережливого производства и управления качеством; - применение эффективных технологий бережливого производства в управлении процессами; - освоение методов оценки эффективности проектов по бережливому производству. Знания: основных особенностей, понятий и принципов бережливого производства; современных технологий бережливого производства и методов их внедрения; взаимосвязей бережливого производства и управления качеством. Умение: планировать и реализовывать мероприятия по улучшению в соответствии с методами бережливого производства; встраивать бережливые технологии в процессы управления качеством. Навыки применения технологии бережливого производства в управлении процессами организации в контексте ее внутренней среды и гармонизация требований СМК и бережливых технологий в процессах организации.. Индивидуальное домашнее задание (ИДЗ) выполняется студентом в форме письменной работы по указанной ниже теме и предполагает проверку знания обучающимися пройденного материала.  ИДЗ формируется по данным организации, в которой студент проходит практику.  Структура письменной работы должна включать в себя следующие смысловые элементы:  1) введение, в котором студент характеризует деятельность компании;  2) основная часть, посвящённая раскрытию сути вопроса; 3) заключение, в котором подводятся итоги изложенного материала, высказывается индивидуальная позиция студента по изложенному материалу.  Объем письменной работы в текстовом виде не должен превышать 30 страниц печатного текста. Работа сдается преподавателю в установленный графиком текущего контроля срок. Используя ниже приведенный список, необходимо сформировать стратегию применения технологий бережливого производства в исследуемой компании.  Для этого:  1.  Выберите модель организации проектной деятельности, предложите политику управления проектной деятельностью. Определите портфель проектов по бережливому производству, критерии оценки эффективности проектной деятельности и зоны ответственности по портфелю проектов различных ролей. 2. Приведите пример проекта по улучшению (реальный кейс предприятия) согласно методологии DMAIC в рамках предложенного портфеля проектов. Приведите описание каждого шага методологии, команды проекта; предложите процедуру рабочих встреч по исполнению проекта. 3. Разработайте систему мотивации для руководителей высшего и среднего звена, участников проектов и работников на местах реализации проектов. Пример возможных мероприятий, реализуемых в рамках проекта по бережливому производству (на примере конкретного процесса и продукта организации).  1. Снижение уровня несоответствий в производственном процессе. 2. Сокращение времени протекания процесса. 3. Снижение потерь в процессе. 4. Повышение стабильности процесса.   ТРЕБОВАНИЯ К ОФОРМЛЕНИЮ ТЕКСТОВЫХ ДОКУМЕНТОВ ИДЗ: 1) используйте программный продукт Microsoft Word; 2) поля  - 2 см со всех сторон; шрифт  - Times New Roman 14; межстрочный интервал - 1,5 см; абзацный отступ - 1,25 см; книжная ориентация страницы; номера страниц обозначаются сверху, выравнивание текста производится по центру; на титульном листе номер не ставится, нумерация начинается со 2 страницы; текст оформляется без переносов, выравнивание производится по ширине страницы. 3) на все рисунки обязательны ссылки; рисунок и заголовок (подпись) выравниваются посередине листа; заголовок рисунка оформляется под рисунком;   4) заголовок пишется обычным шрифтом (без курсива и подчеркивания); 5) на все таблицы в тексте обязательны ссылки, таблица должна идти сразу же; заголовок таблицы рекомендуется писать обычным шрифтом, никак не выделяя; заголовок таблицы выравнивается по правому краю, а сама таблица по середине листа; 6) при наличии ссылок на источники они размещаются сразу же после того объекта, к которому относятся [1, с. 151]; ссылки нумеруются арабскими цифрами по мере использования по тексту; ссылка на один и тоже источник имеет одинаковый номер; ссылки также указываются в списке использованных источников в порядке использования по тексту.. № 2 Тема: Теория вероятностей 1. В билете 3 вопроса. Студент знает 20 вопросов из 40. С какой вероятностью он сдаст экзамен, если достаточно ответить на 2 вопроса из трех. 2. В партии n = 100 изделий. Вероятность брака p = 0,02. Используя приближенную формулу Пуассона, найдите вероятность события, означающего, что в партии не более одного бракованного изделия. Вопрос № 1.  Производственная система включает в себя …  1. персонал и оборудование; 2. материалы и методы;  3. все перечисленное; 4. процессы. Вопрос № 2. Целью проекта по совершенствованию производственного процесса может являться:  1. повышение качества продукции;  2. повышение производительности оборудования;  3. все перечисленное;  4. расширение узкого места в процессе. Вопрос № 3. Проект по улучшению включает следующие этапы: 1. анализ текущего состояния;  2. проектирование целевого состояния;  3. все перечисленное;  4. анализ рисков перехода к целевому состоянию. Вопрос № 4. Применение методологии DMAIC не предусмотрено, когда:  1.   определены процессы во всей организации;  2. в организации отсутствует описание процессов;  3. всеми определенными процессами управляют и выполняют необходимые измерения;  4. все процессы в организации постоянно улучшают. Вопрос № 5.  Для оценки развития производственной системы внедряется учетная модель: 1. с едиными финансовыми показателями процесса для финансовых и производственных подразделений ;  2. оперативно отображающая виды брака в процессе;  3. оперативно отображающая виды брака в процессе;  4. с едиными финансовыми показателями процесса для финансовых и производственных подразделений. Вопрос № 6.  Анализ текущего состояния включает в себя: 1. картирование процесса;  2. анализ коренных причин потерь и проблем процесса;  3. поиск и идентификация потерь в процессе;  4. все перечисленное. Вопрос № 7. Переход к целевому состоянию предполагает: 1. реализацию плана мероприятий; 2. мониторинг процесса; 3. оценку достижения поставленных целей;  4. анализ рисков целевого состояния. Вопрос № 8.  На каких этапах проекта целесообразно проводить хронометраж? 1. Анализ текущего состояния; 2. Оценка условий труда; 3. Обучение сотрудников; 4. Планирование этапов проекта. Вопрос № 9.  Методология \"DMAIC\" направлена на: 1. все перечисленное; 2. повышение финансовой эффективности; 3. повышение безопасности; 4. обеспечение удовлетворенности потребителя. Вопрос № 10. Число дефектов (несоответствий) на миллион возможных дефектов рассчитывается с учетом: 1. всего перечисленного;  2. количества выявленных несоответствий;  3. количества произведенных единиц продукции;  4. количества видов несоответствий. Министерство науки и высшего образования Российской Федерации ФГАОУ ВО «Санкт-Петербургский государственный электротехнический университет «ЛЭТИ» имени В.И. Ульянова (Ленина)» ____________________________________________________________ ЭКЗАМЕНАЦИОННЫЙ БИЛЕТ № 1 Дисциплина Физические основы электронагрева   ИНПРОТЕХ 1. Принципы производственной системы ТРS (Toyota Production System) 2. Организация рабочего места по методике 5S 3. Задача. УТВЕРЖДАЮ Заведующий кафедрой                                                   И.И. Иванов. Основы концепции бережливого производства. Основные понятия, термины и определения. Предмет и задачи дисциплины. Значение концепции бережливого производства. Операционные ресурсы, подлежащие оптимизации. Взаимосвязь инструментов бережливого производства и инструментов управления качеством. Мировые практики, успешный опыт компаний. Обзор нормативно-правовой базы бережливого производства. Политика управления проектами по бережливому производству. Основные отличия бережливых проектов, взаимосвязь стратегии с проектной деятельностью, типы проектов, анализ наличия ошибок в организации; риски, связанные с проектной деятельностью. Модели организации проектной деятельности, политика управления проектной деятельностью. Критерии оценки эффективности проектной деятельности. Структурирование проектов, планирование портфеля проектов; зоны ответственности по портфелю проектов различных ролей. Организация и оценка эффективности применения бережливых технологий в процессах организации. Методология DMAIC. Исследование каждого шага методологии. Ведение проекта: документирование, календарное и ресурсное планирование, типовые проекты по разным типам задач, команда проекта; процедура рабочих встреч по исполнению проекта; ретроспективный анализ. Инфраструктура для реализации бережливых технологий. Ролевая структура управления проектами; формирование группы улучшения, как профиль компетенции ключевых участников проектной деятельности; программа обучения управлению проектами по бережливому производству. Планирование и мотивация совершенствования. Заключение. Преодоление сопротивления изменениям. Корпоративная культура и бережливое производство. Система гибкой мотивации для руководителей высшего и среднего звена, участников проектов и работников на местах реализации проектов.",
		"text_proj" : "Разработка системы детектирования и идентификации объектов на кадрах. Объект исследования: разрозненные геопривязанные кадры видео Предмет исследования: детекция, классификация и идентификация объектов интереса Цель: Определить, какому из заранее заданных классов принадлежит объект Проблема: Протяженность объектов может быть различной, в том числе, не помещающихся на одно изображение Формулировка задачи: необходимо разработать систему идентификации объектов, найденных системой вскрытия, определяющую тип и характеристики найденного объекта или помечающую выделенный объект, как неинтересный. Обязательно должен: знать: язык программирования (С++ или Java или Python); уметь: работать в команде. Желательно должен: знать: математические основы детекции объектов (понятие свёртки, машинного обучения.); владеть: английским языком достаточным для чтения статей. В результате получит: знания: математические основы компьютерного зрения, алгоритмы машинного обучения; умения: проведение научного исследования, прикладное создание программного фреймворка; опыт: работы на предприятии в условиях проекта, близкого к реальному. Сформировать список алгоритмов идентификации. Необходимо сформировать список алгоритмов идентификации. Создать framework, позволяющий решать задачу идентификации несколькими методами. Необходимо создать framework, позволяющий решать задачу идентификации несколькими методами. Сформировать критерии сравнения алгоритмов. Необходимо сформировать критерии сравнения алгоритмов. Сравнить запрограммированные алгоритмы по выбранным критериям. Необходимо сравнить запрограммированные алгоритмы по выбранным критериям. ",
		"need_match":  false 
	},
	{
		"id_rp": "1558",
		"id_proj": "31",
		"name_rp": "Оценка соответствия и аудит",
		"name_proj": "Определение состояния автомобиля используя видео",
		"text_rp": "Дисциплина предназначена для изучения основ оценки соответствия, аудита систем менеджмента организаций и направлена на приобретение навыков применения нормативных документов и стандартов в области оценки соответствия и аудита; изучение правил и методик организации и проведения работ по оценке соответствия систем менеджмента (внутреннего и внешнего аудита), аккредитации органов по сертификации; формирование знаний принципов, методов построения и функционирования национальной и международных систем сертификации и аккредитации.. Изучение методических основ оценки соответствия СМК и управления процессом аудита, приобретение умений по планированию и проведению процедур сертификации и процесса аудита, знание основных нормативных документов в области сертификации и аудита. Планированию и проведению процедур сертификации и процесса аудита Сбор свидетельств аудита, квалификация статуса несоответствий и документирование результатов аудита Оценка соответствия СМК установленным требованиям. Приобретение знаний по планированию и проведению: процедур сертификации продукции/услуг и систем менеджмента; процесса аудита; для сбора свидетельств аудита. Приобретение умений по планированию и проведению процедур сертификации и процесса аудита; сбору свидетельств аудита; классификации несоответствий. Формированию навыков для планирования и проведения процедуры сертификации; процесса аудитадля оценки соответствия СМК; сбора свидетельств аудита; для квалификации статуса несоответствий и документирования результатов аудита. не предусмотретно. Министерство науки и высшего образования Российской Федерации ФГАОУ ВО «СанктПетербургский государственный электротехнический университет «ЛЭТИ» имени В.И. Ульянова (Ленина)» ЭКЗАМЕНАЦИОННЫЙ БИЛЕТ № 1 Дисциплина ОЦЕНКА СООТВЕТСТВИЯ И АУДИТ 1. Основные положения сертификации: Цели и задачи сертификации систем менеджмента качества, продукции и услуг. Законодательная основа обеспечения качества в России. 2. Менеджмент программы аудита: Блок-схема менеджмента программой аудита. Виды аудитов. Цели и задачи аудита системы менеджмента качества. (аудита первой, второй или третьей стороной)                                  УТВЕРЖДАЮ                                Заведующий кафедрой МСК                                                                                                                                               С.Н. Кузьмина  . Введение. \"Оценка соответствия и аудит\" как учебная дисциплина и как вид практической деятельности. Предмет и метод курса «Оценка соответствия и аудит». Методологические основы и задачи учебной дисциплины и ее взаимосвязи с другими дисциплинами учебного плана. Раздел 1 Оценка соответствия. Тема 1.1 Основные понятия сертификации (оценки соответствия). Основные определения и понятия. Системы сертификации их статус, правила организации и функционирования. Цели и задачи сертификации систем менеджмента качества, продукции и услуг. Цели и задачи введения национальной системы сертификации. Законодательная основа обеспечения качества в России. Российская система сертификации ГОСТ-Р, структура и принципы построения. Сертификация гарант соответствия систем менеджмента качества, продукции и услуг нормативным документам (государственным и международным стандартам). Аккредитация, сертификация и нормирование. Законодательно регулируемая (обязательная) и законодательно нерегулируемая (добровольная) области сертификации продукции и услуг. Экономическая эффективность получения сертификата на системы менеджмента качества, продукцию и услуги. Особенности сертификации систем, продукции и услуг в различных областях. Пути и механизмы международного признания сертификатов в ЕС, деятельность Европейских организаций по аккредитации лабораторий (EAL). Тема 1.2. Нормативное обеспечение работ по оценке соответствия. Комплекс государственных стандартов «Система сертификации ГОСТ Р. Регистр систем качества»: ГОСТ Р 40.001 – Правила по проведению сертификации систем качества в Российской Федерации; ГОСТ Р 40.002 – Система сертификации ГОСТ Р. Регистр системы качества. Основные положения; ГОСТ Р 40.003 – Система сертификации ГОСТ Р. Регистр системы качества. Порядок сертификацию систем менеджмента качества на соответствие ГОСТ Р ИСО 9001 (ISO 9001); ГОСТ Р ИСО/МЭК 17021– Оценка соответствия. Требования к органам, проводящим аудит и сертификацию cистем менеджмента; ГОСТ ИСО 9000 - Системы менеджмента качества. Основные положения и словарь; ГОСТ Р ИСО 9001 - Cистемы менеджмента качества. Требования; ГОСТ Р ИСО 9004 – Руководство по достижению устойчивого развития организации; ГОСТ Р ИСО 19011- Руководящие указания по аудиту систем менеджмента. Тема 1.3. Сертификация систем менеджмента, продукции/услуг (обязательная и добровольная сертификация). Сертификация продукции и услуг на соответствие требованиям безопасности и электромагнитной совместимости (ЭМС). Сертификация продукции и услуг на соответствие требованиям Таможенного союза. Модули для оценки соответствия в системе сертификации ЕС, схемы сертификации продукции в системе ГОСТ Р, схемы сертификации в системе технических регламентов Таможенного союза. Требования к аккредитации испытательных лабораторий. Общие требования к органам по сертификации продукции. Тема 1.4. Процедура сертификации систем менеджмента качества (СМК). Порядок и правила проведения сертификации, основные цели и условия. Объекты проверки и оценки системы качества. Участники проверки: состав комиссии, принципы ее формирования. Ответственность и обязанности экспертов и председателя комиссии. Обязанности заявителя. Организация работ: предсертификационный аудит как первый шаг на пути к успешной сертификации системы менеджмента качества (вступление в договорные отношения) и три этапа сертификации: предварительная оценка системы менеджмента качества (анализ документации); проверка и оценка системы менеджмента качества в организации (на месте); представление отчета по аудиту в комиссию по сертификации и принятие решения о выдаче сертификата соответствия; инспекционный контроль сертифицированной системы менеджмента качества. Цели и основное содержание этапов. Тема 1.5. Аккредитация органов по сертификации (ОС). Система органов по сертификации, испытательные лаборатории и центры. Аккредитация органов по сертификации и требования к ним. Область и объекты аккредитации. Организация работ по аккредитации объектов. Порядок и процедуры аккредитации органов по сертификации систем менеджмента качества. Раздел 2 Аудит. Тема 2.1. Основные понятия аудита. Основные определения и понятия. Цели и задачи аудита систем менеджмента качества. Предпосылки для проведения аудита. Тема 2.2. Нормативное обеспечение аудита. Толкование требований стандарта ГОСТ Р ИСО 19011: • Область применения стандарта • Принципы аудита • Менеджмент программы аудита • Действия при аудитах Компетентность и оценка аудиторов. Тема 2.3. Виды аудитов, их планирование и подготовка. Виды аудита: внешний аудит, внутренний аудит, системный аудит, аудит процесса, аудит продукции. Аудит первой стороной, второй стороной, третьей стороной. План аудита, область аудита, частота аудита, самопроверка и предварительный аудит, предварительная проверка документации системы менеджмента качества, определение времени аудита, информирование необходимых органов / структурных подразделений, составление документации. Тема 2.4. Аудитор и группа аудиторов, компетентность аудиторов. Требования к аудитору: • знания нормативной документации (ГОСТ Р ИСО 9001, ГОСТ Р ИСО 19011, специальные стандарты по продукции) • знание структуры и организации процессов на предприятии, • опыт в составлении чек-листов, • знание продукции и процедуры аудита, • личные качества аудитора, • организаторские и профессиональные качества аудитора. Группа аудиторов: - ведущий аудитор • подготовка аудиторов к аудиту, • ответственность аудиторов, • независимость аудиторов, • функции аудиторов. Человеческие аспекты в процедуре проведения аудита: поведение при беседах, риторика, общение, анализ ситуации, ход обсуждения, техника переговоров. Чек-листы: структура, чек-лист со шкалой оценок, “шпаргалка” для аудитора. Тема 2.5. Процедура аудита и порядок её проведения. Порядок и правила проведения аудита; проверка документации системы менеджмента качества; входное совещание; сбор доказательств, наблюдения ходе аудита; заключительное совещание по проведенному аудиту. Документы аудита. Ознакомление с практикой проведения внутренних аудитов в различных отраслях по материалам периодической печати. Тема 2.6. Корректирующие действия и управление рисками как предупреждение появления несоответствий. Планирование мероприятий по исправлению и не допущения повторения выявленных несоответствий и предупреждения их появления. Ответственность за их реализацию. Проверка их выполнения и оценка их эффективности. Управление рисками как инструмент предупреждения появления несоответствий в процедуре аудита. Контроль управления рисками с целью предупреждения появления несоответствий. Заключение. Лучшие практики сертифицированных систем менеджмента качества – как инструмент эффективного управления и конкурентного преимущества, а внутренний аудит как инструмент для постоянного улучшения действующей системы менеджмента качества",
		"text_proj" : "Определение состояния автомобиля используя видео. Цель работы: определять направление движения автомобиля, его остановки и старты по видеозаписи с видеорегистратора. Приложение, используя машинное обучение (или другие алгоритмы и технологии), определяет и классифицирует состояние автомобиля по видеозаписи с видеорегистратора: стоит автомобиль или движется, направление движения автомобиля (движется по прямой, вперед или назад, повернул направо/налево). Сначала сеть обучают (на имеющихся размеченных данных) и тестируют на десктопе. На телефон устанавливается пред-обученная версия (например, \"легкая\" версия tensorflow) с готовой моделью, которая производит обработку видеосигнала. Что требуется: Провести анализ имеющихся решений (state of the art); Установить выбранный фреймворк; Изучить архитектуру и возможности выбранного фреймворка, библиотек; Реализовать алгоритм классификации (предобработка данных, модель нейронной сети); Разделить имеющийся датасет (видеозаписи с размеченными состояниями автомобиля, в котором установлен видеорегистратор) на два набора: для обучения модели и для тестирования модели; Выполнить эксперименты на размеченных данных для получения метрик и на неразмеченных данных для исследования генерализации модели; Написать отчет об исследовании, подготовить презентацию. Обязательно должен: знать: Python уметь: работать с Git, использовать Open Source фреймворки и библиотеки, искать необходимые наборы данных в открытом доступе владеть: навыками изучения программного кода, документаций. Желательно должен: знать: принципы работы машинного обучения, предобработки данных уметь: реализовывать модели нейронных сетей, собирать метрики, визуализировать данные владеть: фреймворками TensorFlow или PyTorch, библиотекой OpenCV. В результате получит: знания: технологии машинного обучения, нейронные сети умения: работать с фреймворками машинного обучения опыт: работа с нейронными сетями, проведение экспериментов, подготовка отчетов и презентаций.",
		"need_match":  false 
	}
]